## Plan Result (1148: prod_xhibit - TerraformPlanApply)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.blob_data_contributor
  * azurerm_role_assignment.blob_data_reader
  * azurerm_role_assignment.blob_landing_data_contributor
  * azurerm_role_assignment.curated_brics_data_contributor
  * databricks_cluster.shared_autoscaling
  * databricks_permissions.sql_endpoint_user
  * databricks_sql_endpoint.sql_warehouse




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.blob_data_contributor will be created
  + resource "azurerm_role_assignment" "blob_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "54157b8a-f55a-4bb3-ba4a-503611df3587"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Storage/storageAccounts/ingest05landingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.blob_data_reader will be created
  + resource "azurerm_role_assignment" "blob_data_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "54157b8a-f55a-4bb3-ba4a-503611df3587"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Storage/storageAccounts/ingest05landingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.blob_landing_data_contributor will be created
  + resource "azurerm_role_assignment" "blob_landing_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "efb2b089-d742-414b-9956-142bf6effb43"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Storage/storageAccounts/ingest05landingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.curated_brics_data_contributor will be created
  + resource "azurerm_role_assignment" "curated_brics_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "54157b8a-f55a-4bb3-ba4a-503611df3587"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Storage/storageAccounts/ingest05curatedprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # databricks_cluster.shared_autoscaling will be created
  + resource "databricks_cluster" "shared_autoscaling" {
      + autotermination_minutes      = 30
      + cluster_id                   = (known after apply)
      + cluster_name                 = "Dlrm Crime Shared Autoscaling prod"
      + custom_tags                  = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-crime"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
        }
      + data_security_mode           = "USER_ISOLATION"
      + default_tags                 = (known after apply)
      + driver_instance_pool_id      = (known after apply)
      + driver_node_type_id          = (known after apply)
      + enable_elastic_disk          = (known after apply)
      + enable_local_disk_encryption = (known after apply)
      + id                           = (known after apply)
      + node_type_id                 = "Standard_DS3_v2"
      + num_workers                  = 0
      + spark_version                = "16.4.x-scala2.12"
      + state                        = (known after apply)
      + url                          = (known after apply)

      + autoscale {
          + max_workers = 15
          + min_workers = 1
        }
    }

  # databricks_permissions.sql_endpoint_user will be created
  + resource "databricks_permissions" "sql_endpoint_user" {
      + id              = (known after apply)
      + object_type     = (known after apply)
      + sql_endpoint_id = (known after apply)

      + access_control {
          + group_name             = "users"
          + permission_level       = "CAN_USE"
            # (2 unchanged attributes hidden)
        }
    }

  # databricks_sql_endpoint.sql_warehouse will be created
  + resource "databricks_sql_endpoint" "sql_warehouse" {
      + auto_stop_mins            = 30
      + cluster_size              = "X-Small"
      + creator_name              = (known after apply)
      + data_source_id            = (known after apply)
      + enable_photon             = true
      + enable_serverless_compute = false
      + health                    = (known after apply)
      + id                        = (known after apply)
      + jdbc_url                  = (known after apply)
      + max_num_clusters          = 5
      + min_num_clusters          = 1
      + name                      = "Dlrm Crime SQl warehouse prod"
      + num_active_sessions       = (known after apply)
      + num_clusters              = (known after apply)
      + odbc_params               = (known after apply)
      + spot_instance_policy      = "COST_OPTIMIZED"
      + state                     = (known after apply)
      + warehouse_type            = "CLASSIC"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 1148: prod_xhibit - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"","Target":"1148: prod_xhibit - TerraformPlanApply","Vars":{}} -->